//**************************************************************************
//**************************************************************************
//**                                                                      **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.             **
//**                                                                      **
//**                       All Rights Reserved.                           **
//**                                                                      **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093            **
//**                                                                      **
//**                       Phone: (770)-246-8600                          **
//**                                                                      **
//**************************************************************************
//**************************************************************************

//**************************************************************************
//<AMI_FHDR_START>
//
// Name:	NB.UNI
//
// Description:	North Bridge String definitions.
//
//<AMI_FHDR_END>
//**************************************************************************
/=#
#include "VFR.uni"

#langdef   x-AMI "x-AMI"    // AMI Configuration Language


#string STR_NULL_HELP                   #language eng ""
#string STR_NULL_HELP                   #language fra ""
#string STR_NB_FORM                     #language eng "North Bridge"
#string STR_NB_FORM_HELP                #language eng "North Bridge Parameters"

#string STR_NB_FAM15_ONLY_TEXT          #language eng "Family 15h only"

#string STR_BLANK_STRING                  #language    eng    " "
#string STR_DISABLED_TEXT                 #language    eng    "Disabled"
#string STR_ENABLED_TEXT                  #language    eng    "Enabled"
#string STR_DEFAULT_TEXT                  #language    eng    "Default"

//
// North Bridge general configuration
//
#string STR_NB_CONFIG                     #language eng "North Bridge Configuration"

#string STR_NODE0_FORM                    #language eng "Node 0 Information"
#string STR_NODE0_FORM                    #language fra "Noeud 0 Renseignements"

#string STR_NODE0_HELP                    #language eng "View Memory Information related to Node 0"
#string STR_NODE0_HELP                    #language fra "Les Renseignements de Mémoire de Vue rattachés au Noeud 0"

#string STR_SCKT0_FORM                    #language eng "Socket 0 Information"
#string STR_SCKT0_HELP                    #language eng "View Information related to Socket 0"

//--------------------------------------------------------------------
//Memory information
#string STR_MEMORY                      #language eng "Memory Information"
#string STR_MEMORY_SIZE_NAME            #language eng "Total Memory"
#string STR_MEMORY_SIZE_VALUE           #language eng "N/A" // Dynamically updated
#string STR_MEMORY_SIZE_HELP            #language eng "Total Memory in the System."

// Socket 0 information
#string STR_MEMORY_SCKT0_START_ADDRESS_VALUE  #language eng "  Starting Address: Unknown"
#string STR_MEMORY_SCKT0_END_ADDRESS_VALUE    #language eng "    Ending Address: Unknown"
#string STR_MEMORY_SIZE_SCKT0_SLOT0_VALUE     #language eng "Dimm0: Not Present"
#string STR_MEMORY_SIZE_SCKT0_SLOT1_VALUE     #language eng "Dimm1: Not Present"
#string STR_MEMORY_SIZE_SCKT0_SLOT2_VALUE     #language eng "Dimm2: Not Present"
#string STR_MEMORY_SIZE_SCKT0_SLOT3_VALUE     #language eng "Dimm3: Not Present"
#string STR_MEMORY_SIZE_SCKT0_SLOT4_VALUE     #language eng "Dimm4: Not Present"


#string STR_MEMCFG_SUBMENU_STRING			#language eng	"Memory Configuration"

//--------------------------------------------------------------------
//Memory clock options
#string STR_MEM_CLK_PROMPT                  #language eng   "Memory Clock"
                                            #language x-AMI "NB001"
#string STR_MEM_CLK_PROMPT_HELP      	    #language eng   "This Option Allows User to select different Memory Clock. Default value is 800Mhz."
#string STR_NB_AUTO                         #language eng   "Auto"	 ///< Defsult- DDR Clock will be AUTO (directly from SPD)
#string	STR_DDR800_FREQUENCY_TEXT           #language eng   "800MHz"    ///< DDR 800
#string	STR_DDR1066_FREQUENCY_TEXT          #language eng   "1066MHz"    ///< DDR 1066
#string STR_DDR1333_FREQUENCY_TEXT          #language eng   "1333MHz"    ///< DDR 1333
#string STR_DDR1600_FREQUENCY_TEXT          #language eng   "1600MHz"    ///< DDR 1333
#string STR_DDR1866_FREQUENCY_TEXT          #language eng   "1866MHz"    ///< DDR 1866
#string STR_DDR2100_FREQUENCY_TEXT          #language eng   "2100MHz"   ///< DDR 2100
#string STR_DDR2133_FREQUENCY_TEXT          #language eng   "2133MHz"   ///< DDR 2133
#string STR_DDR2400_FREQUENCY_TEXT          #language eng   "2400MHz"   ///< DDR 2400

//--------------------------------------------------------------------
//Memory interleaving options
#string STR_BANK_INTERLEAVE                 #language eng   "Bank Interleaving"
                                            #language x-AMI "NB002"
#string STR_BANK_INTERLEAVE_HELP            #language eng   "Enable/Disable Bank Interleaving"
#string STR_CHANNEL_INTERLEAVE				#language eng	"Channel Interleaving"
                                            #language x-AMI "NB003"
#string STR_CHANNEL_INTERLEAVE_HELP         #language eng   "Enable/Disable Channel Interleaving"


//--------------------------------------------------------------------
//Memory clear options
#string STR_MEMCLR                          #language eng   "Memory Clear"
                                            #language x-AMI "NB004"
#string STR_MEMCLR_HELP                     #language eng   "Enable/Disable Memory Clear function"

//**************************************************************************
//**************************************************************************
//**                                                                      **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.             **
//**                                                                      **
//**                       All Rights Reserved.                           **
//**                                                                      **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093            **
//**                                                                      **
//**                       Phone: (770)-246-8600                          **
//**                                                                      **
//**************************************************************************
//**************************************************************************